yangkunming99/TizenRT/os/board/rtl8721csm/src/component/os/tizenrt/tizenrt_service.c
static void _tizenrt_enter_critical(_lock *plock, _irqL *pirqL)
{
	save_and_cli();
}

static void _tizenrt_exit_critical(_lock *plock, _irqL *pirqL)
{
	restore_flags();
}

static void _tizenrt_enter_critical_from_isr(_lock *plock, _irqL *pirqL)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
}

static void _tizenrt_exit_critical_from_isr(_lock *plock, _irqL *pirqL)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
}

static int _tizenrt_enter_critical_mutex(_mutex *pmutex, _irqL *pirqL)
{
	int temp;
	temp = sem_wait(*pmutex);
	if (temp != 0) {
		DBG_ERR("_tizenrt_spinlock failed!\n");
	}
	return temp;
}

static void _tizenrt_exit_critical_mutex(_mutex *pmutex, _irqL *pirqL)
{
	sem_post(*pmutex);
}

#if defined(CONFIG_PLATFORM_8195BHP)
#include "timer_api.h"
static gtimer_t tmp_timer_obj;
#endif
static void _tizenrt_cpu_lock(void)
{
#if defined(CONFIG_PLATFORM_8195BHP)
	__disable_irq();
	icache_disable();
	dcache_disable();

	gtimer_init(&tmp_timer_obj, 0xff);
	gtimer_reload(&tmp_timer_obj, 400 * 1000);	// 4s
	gtimer_start(&tmp_timer_obj);
#endif
}

static void _tizenrt_cpu_unlock(void)
{
#if defined(CONFIG_PLATFORM_8195BHP)
	int duration = (int)gtimer_read_us(&tmp_timer_obj) / 1000;
	gtimer_deinit(&tmp_timer_obj);
	/* compensate rtos tick */
	vTaskIncTick(duration);
	icache_enable();
	icache_invalidate();
	__enable_irq();
#endif
}

static void _tizenrt_spinlock_init(_lock *plock)
{
	if (*plock == NULL) {
		*plock = _tizenrt_zmalloc(sizeof(sem_t));
		if (*plock == NULL) {
			ndbg("\r\n _tizenrt_spinlock_init failed \n");
			return;
		}
	}
	sem_init(*plock, 0, 1);
	sem_setprotocol(*plock, SEM_PRIO_NONE);
}

static void _tizenrt_spinlock_free(_lock *plock)
{
	int i;
	if (*plock != NULL) {
		i = sem_destroy(*plock);
		if (i == 0) {
			kmm_free(*plock);
		} else {
			ndbg("\r\n _tizenrt_spinlock_free fail!!! \n");
		}
	}
	*plock = NULL;
}

static void _tizenrt_spinlock(_lock *plock)
{
	int temp;
	temp = sem_wait(*plock);
	if (temp != 0) {
		DBG_ERR("_tizenrt_spinlock failed!\n");
	}
}

static void _tizenrt_spinunlock(_lock *plock)
{
	sem_post(*plock);
}

static void _tizenrt_spinlock_irqsave(_lock *plock, _irqL *irqL)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
	save_and_cli();
	_tizenrt_spinlock(plock);
}

static void _tizenrt_spinunlock_irqsave(_lock *plock, _irqL *irqL)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
	_tizenrt_spinunlock(plock);
	restore_flags();
}

static int _tizenrt_init_xqueue(_xqueue *queue, const char *name, u32 message_size, u32 number_of_messages)
{
	mqd_t pmqd;
	struct mq_attr attr;

	if (!queue) {
		DiagPrintf("%s queue is NULL\r\n", __func__);
		return _FAIL;
	}

	if (*queue) {
		DiagPrintf("%s msg queue already init NULL\r\n", __func__);
		return _FAIL;
	}
	if (message_size > MQ_MAX_BYTES) {
		DiagPrintf("%s message_size(%d) > MQ_MAX_BYTES(%d)\r\n", __func__, message_size, MQ_MAX_BYTES);
		return _FAIL;
	}
	attr.mq_maxmsg = number_of_messages;
	attr.mq_msgsize = message_size;

	pmqd = mq_open((const char *) name, O_RDWR | O_CREAT, 0666, &attr);
	if (pmqd == (mqd_t) ERROR) {
		DiagPrintf("%s mq open fail\r\n", __func__);
		return _FAIL;
	}

	*queue = pmqd;

	return _SUCCESS;
}

static int _tizenrt_push_to_xqueue(_xqueue *queue, void *message, u32 timeout_ms)
{
	int prio = MQ_PRIO_MAX;

	if (!queue || *queue == NULL) {
		DiagPrintf("%s queue is NULL\r\n", __func__);
		return _FAIL;
	}

	if (timeout_ms != RTW_MAX_DELAY) {
		struct timespec ts;
		clock_gettime(CLOCK_REALTIME, &ts);
		ts.tv_sec += timeout_ms / 1000;
		ts.tv_nsec += (timeout_ms % 1000) * 1000 * 1000;
		if (mq_timedsend((mqd_t) *queue, message, ((mqd_t) *queue)->msgq->maxmsgsize, prio, &ts) != OK) {
			DiagPrintf("%s mq time send fail\r\n", __func__);
			return _FAIL;
		}
	} else {
		if (mq_send((mqd_t) *queue, message, ((mqd_t) *queue)->msgq->maxmsgsize, prio) != OK) {
			DiagPrintf("%s mq send fail\r\n", __func__);
			return _FAIL;
		}
	}

	return _SUCCESS;
}

static int _tizenrt_pop_from_xqueue(_xqueue *queue, void *message, u32 timeout_ms)
{
	int prio;

	if (!queue || *queue == NULL) {
		DiagPrintf("%s queue is NULL\r\n", __func__);
		return _FAIL;
	}


	if (timeout_ms != RTW_MAX_DELAY) {
		struct timespec ts;
		clock_gettime(CLOCK_REALTIME, &ts);
		ts.tv_sec += timeout_ms / 1000;
		ts.tv_nsec += (timeout_ms % 1000) * 1000 * 1000;
		if (mq_timedreceive((mqd_t) *queue, message, ((mqd_t) *queue)->msgq->maxmsgsize, &prio, &ts) == ERROR) {
			if(ETIMEDOUT != get_errno())
			{
				printf("[osif_msg_recv] mq time receive fail errno:%d\r\n", get_errno());
			}
			return _FAIL;
		}
	} else {
		if (mq_receive((mqd_t) *queue, message, ((mqd_t) *queue)->msgq->maxmsgsize, &prio) == ERROR) {
			printf("[osif_msg_recv] mq receive fail\r\n");
			return _FAIL;
		}
	}

	return _SUCCESS;
}

static int _tizenrt_peek_from_xqueue( _xqueue* queue, void* message, u32 timeout_ms )
{
	struct mqueue_inode_s *msgq;
	struct mqueue_msg_s *rcvmsg;
	mqd_t mqdes;
	int prio;
	if (!queue || *queue == NULL) {
		DiagPrintf("%s queue is NULL\r\n", __func__);
		return _FAIL;
	}
	mqdes = (mqd_t)* queue;
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
	/* Get a pointer to the message queue */
	msgq = mqdes->msgq;
	if (timeout_ms == 0)
		timeout_ms = RTW_MAX_DELAY;
	/* Get the message from the head of the queue */
	while ((rcvmsg = (FAR struct mqueue_msg_s *)sq_remfirst(&msgq->msglist)) == NULL && timeout_ms) {
		usleep((unsigned int)1 * 1000);
		timeout_ms--;
	}

	if (rcvmsg) {
		/* Copy the message into the caller's buffer */
		memcpy(message, (const void *)rcvmsg->mail, rcvmsg->msglen);
		return _SUCCESS;
	}

	return _FAIL;
}

static int _tizenrt_deinit_xqueue(_xqueue *queue)
{
	if (!queue || *queue == NULL) {
		DiagPrintf("%s queue is NULL\r\n", __func__);
		return _FAIL;
	}

	if(mq_close((mqd_t) *queue) != OK) {
		DiagPrintf("%s mq 0x%x close fail\r\n", __func__, *queue);
		return _FAIL;
	}

	return _SUCCESS;
}

static u32 _tizenrt_get_current_time(void)
{
	return (u32) clock();
}

static u32 _tizenrt_systime_to_ms(u32 sys_time)
{

	return (sys_time * 1000L / TICK_PER_SEC);
}

static u32 _tizenrt_systime_to_sec(u32 sys_time)
{

	return (sys_time / TICK_PER_SEC);
}

static u32 _tizenrt_ms_to_systime(u32 ms)
{

	return (ms * TICK_PER_SEC / 1000L);
}

static u32 _tizenrt_sec_to_systime(u32 sec)
{

	return (sec * TICK_PER_SEC);
}

static void _tizenrt_msleep_os(int ms)
{
	usleep((unsigned int)ms * 1000);
}

