yangkunming99/TizenRT/os/board/rtl8721csm/src/component/os/tizenrt/tizenrt_service.c
static void _tizenrt_usleep_os(int us)
{
	usleep((unsigned int)us);
}

static void _tizenrt_mdelay_os(int ms)
{
	up_mdelay((unsigned long)ms);
}

static void _tizenrt_udelay_os(int us)
{
	up_udelay((unsigned long)us);
}

static void _tizenrt_yield_os(void)
{
	sched_yield();
}

static void _tizenrt_ATOMIC_SET(ATOMIC_T *v, int i)
{
	atomic_set(v, i);
}

static int _tizenrt_ATOMIC_READ(ATOMIC_T *v)
{
	return atomic_read(v);
}

static void _tizenrt_ATOMIC_ADD(ATOMIC_T *v, int i)
{
	save_and_cli();
	v->counter += i;
	restore_flags();
}

static void _tizenrt_ATOMIC_SUB(ATOMIC_T *v, int i)
{
	save_and_cli();
	v->counter -= i;
	restore_flags();
}

static void _tizenrt_ATOMIC_INC(ATOMIC_T *v)
{
	_tizenrt_ATOMIC_ADD(v, 1);
}

static void _tizenrt_ATOMIC_DEC(ATOMIC_T *v)
{
	_tizenrt_ATOMIC_SUB(v, 1);
}

static int _tizenrt_ATOMIC_ADD_RETURN(ATOMIC_T *v, int i)
{
	int temp;

	save_and_cli();
	temp = v->counter;
	temp += i;
	v->counter = temp;
	restore_flags();

	return temp;
}

static int _tizenrt_ATOMIC_SUB_RETURN(ATOMIC_T *v, int i)
{
	int temp;

	save_and_cli();
	temp = v->counter;
	temp -= i;
	v->counter = temp;
	restore_flags();

	return temp;
}

static int _tizenrt_ATOMIC_INC_RETURN(ATOMIC_T *v)
{
	return _tizenrt_ATOMIC_ADD_RETURN(v, 1);
}

static int _tizenrt_ATOMIC_DEC_RETURN(ATOMIC_T *v)
{
	return _tizenrt_ATOMIC_SUB_RETURN(v, 1);
}

static u64 _tizenrt_modular64(u64 n, u64 base)
{
	unsigned int __base = (base);
	unsigned int __rem;

	if (((n) >> 32) == 0) {
		__rem = (unsigned int)(n) % __base;
		(n) = (unsigned int)(n) / __base;
	} else {
		__rem = __div64_32(&(n), __base);
	}

	return __rem;
}

/* Refer to ecos bsd tcpip codes */
static int _tizenrt_arc4random(void)
{
#if defined(CONFIG_PLATFORM_8721D)
	int value = (int)Rand();
	return value;

#else
	u32 res = xTaskGetTickCount();
	static unsigned long seed = 0xDEADB00B;

#if defined(CONFIG_PLATFORM_8711B)
	if (random_seed) {
		seed = random_seed;
		random_seed = 0;
	}
#endif

	seed = ((seed & 0x007F00FF) << 7) ^ ((seed & 0x0F80FF00) >> 8) ^	// be sure to stir those low bits
		   (res << 13) ^ (res >> 9);	// using the clock too!
	return (int)seed;
#endif
}

static int _tizenrt_get_random_bytes(void *buf, size_t len)
{
	unsigned int ranbuf;
	unsigned int *lp;
	int i, count;
	count = len / sizeof(unsigned int);
	lp = (unsigned int *)buf;

	for (i = 0; i < count; i++) {
		lp[i] = _tizenrt_arc4random();
		len -= sizeof(unsigned int);
	}

	if (len > 0) {
		ranbuf = _tizenrt_arc4random();
		_tizenrt_memcpy(&lp[i], &ranbuf, len);
	}
	return 0;
}

static u32 _tizenrt_GetFreeHeapSize(void)
{
	return 0;
}

static int wrapper_thread(int argc, char *argv[])
{
	int func_addr, ctx_addr;
	thread_func_t func;
	void *thctx;
	if (argc != 3) {
		DBG_ERR("%s error\n", argv[0]);
		return -1;
	}
	/* Arguments : [0] task name [1] func addr, [2] ctx addr */
	func_addr = strtoul(argv[1], NULL, 16);
	ctx_addr = strtoul(argv[2], NULL, 16);
	func = (thread_func_t)func_addr;
	thctx = (void *)ctx_addr;
	func(thctx);
	return OK;
}
static int _tizenrt_create_task(struct task_struct *ptask, const char *name, u32 stack_size, u32 priority, thread_func_t func, void *thctx)
{
#if USE_PTHREAD_MUTEX
	pthread_attr_t attr;
	struct sched_param sparam;
	int res = 0;

	pthread_t tid;

	res = pthread_attr_init(&attr);
	if (res != OK) {
		DBG_ERR("Failed to pthread_attr_init\n");
		goto err_exit;
	}

	stack_size *= sizeof(uint32_t);
	res = pthread_attr_setstacksize(&attr, stack_size);
	if (res != OK) {
		DBG_ERR("Failed to pthread_attr_setstacksize\n");
		goto err_exit;
	}

	sparam.sched_priority = PTHREAD_DEFAULT_PRIORITY + priority;

	res = pthread_attr_setschedparam(&attr, &sparam);
	if (res != OK) {
		DBG_ERR("Failed to pthread_attr_setstacksize\n");
		goto err_exit;
	}

	res = pthread_create(&tid, &attr, (pthread_startroutine_t) func, thctx);
	if (res != OK) {
		DBG_ERR("Failed to pthread_create\n");
		goto err_exit;
	}
	if (tid == 0) {
		DBG_ERR("create the task %s failed!", name);
		goto err_exit;
	}
	ptask->task = tid;
	ptask->task_name = name;
	return _SUCCESS;
err_exit:
	ptask->task = -1;
	ptask->task_name = NULL;
	return _FAIL;
#else
	int func_addr, ctx_addr;
	pid_t pid;
	char str_func_addr[9];
	char str_ctx_addr[9];
	char *task_info[3];
	priority = SCHED_PRIORITY_DEFAULT + priority;
	priority = (priority > SCHED_PRIORITY_MAX || priority < SCHED_PRIORITY_MIN)?SCHED_PRIORITY_DEFAULT:priority;
	if(strncmp(name, "rtw_interrupt_thread", strlen("rtw_interrupt_thread") + 1) == 0) priority = 106;
	if(strncmp(name, "rtw_recv_tasklet", strlen("rtw_recv_tasklet") + 1) == 0) priority = 105;
	if(strncmp(name, "rtw_xmit_tasklet", strlen("rtw_xmit_tasklet") + 1) == 0) priority = 105;
	if(strncmp(name, "cmd_thread", strlen("cmd_thread") + 1) == 0) priority = 105;
	if(strncmp(name, "tcp_server_handler", strlen("tcp_server_handler") + 1) == 0) priority = 105;

	stack_size *= sizeof(uint32_t);
	func_addr = (int)func;
	ctx_addr = (int)thctx;
	task_info[0] = itoa(func_addr, str_func_addr, 16);
	task_info[1] = itoa(ctx_addr, str_ctx_addr, 16);
	task_info[2] = NULL;
	pid = kernel_thread(name, priority, stack_size, wrapper_thread, (char * const *)task_info);
	if (pid == ERROR) {
		DBG_ERR("%s fail\n", name);
		return _FAIL;
	}
	ptask->task = pid;
	ptask->task_name = name;
	return _SUCCESS;
#endif
}

static void _tizenrt_delete_task(struct task_struct *ptask)
{
#if USE_PTHREAD_MUTEX
	int status = 0;
	pthread_t tid = (pthread_t) ptask->task;
	if (!ptask->task || tid == 0) {
		DBG_ERR("_tizenrt_delete_task(): ptask is NULL %s!\n", ptask->task_name);
		return;
	}
	status = pthread_cancel(tid);
	if (status != OK) {
		DBG_ERR("delete the task failed, status=%d!\n", status);
		return;
	}
	ptask->task = -1;
#else
	pid_t pid;
	int status;
	pid = (pid_t) ptask->task;
	status = task_delete(pid);
	if (status != OK) {
		DBG_ERR("delete the task failed, status=%d!\n", status);
	}
	ptask->task = -1;
#endif
	return;
}

static void _tizenrt_set_priority_task(void* task, u32 NewPriority)
{
	FAR struct tcb_s *rtcb = sched_gettcb(*(pid_t *)task);
	DiagPrintf("%s %d\r\n", __func__, __LINE__);

	if (rtcb == NULL) {
		prefdbg("Failed to get main task %d!\n", *(pid_t *)task)
		return;
	}

	sched_setpriority(rtcb, NewPriority + SCHED_PRIORITY_DEFAULT);
	return;
}

static int _tizenrt_get_priority_task(void *task)
{
	FAR struct tcb_s *rtcb = sched_gettcb(*(pid_t *)task);
	DiagPrintf("%s %d\r\n", __func__, __LINE__);

	if (rtcb == NULL) {
		prefdbg("Failed to get main task %d!\n", *(pid_t *)task)
		return _FAIL;
	}

	return rtcb->sched_priority - SCHED_PRIORITY_DEFAULT;
}

static void _tizenrt_suspend_task(void *task)
{
	FAR struct tcb_s *rtcb = sched_gettcb(*(pid_t *)task);
	DiagPrintf("%s %d\r\n", __func__, __LINE__);

	if (rtcb == NULL) {
		prefdbg("Failed to get main task %d!\n", *(pid_t *)task)
		return;
	}

	return;
}

