yangkunming99/TizenRT/os/board/rtl8721csm/src/component/os/tizenrt/tizenrt_service.c
static void _tizenrt_resume_task(void *task)
{
	FAR struct tcb_s *rtcb = sched_gettcb(*(pid_t *)task);
	DiagPrintf("%s %d\r\n", __func__, __LINE__);

	if (rtcb == NULL) {
		prefdbg("Failed to get main task %d!\n", *(pid_t *)task)
		return;
	}

	return;
}

static void _tizenrt_thread_enter(char *name)
{
	DBG_INFO("\n\rRTKTHREAD %s\n", name);
}

static void _tizenrt_thread_exit(void)
{
	DBG_INFO("\n\rRTKTHREAD exit %s\n", __FUNCTION__);
#if USE_PTHREAD_MUTEX
	pthread_exit(NULL);
#else
	exit(EXIT_SUCCESS);
#endif
}

_timerHandle _tizenrt_timerCreate(const signed char *pcTimerName, osdepTickType xTimerPeriodInTicks, u32 uxAutoReload, void *pvTimerID, TIMER_FUN pxCallbackFunction)
{
	struct timer_list_priv *timer = (struct timer_list_priv *)_tizenrt_zmalloc(sizeof(struct timer_list_priv));
	if (timer == NULL) {
		DBG_ERR("Fail to alloc priv");
		return NULL;
	}
	timer->work_hdl = (struct work_s *)_tizenrt_zmalloc(sizeof(struct work_s));
	if (timer->work_hdl == NULL) {
		DBG_ERR("Fail to alloc timer->work_hdl");
		kmm_free(timer);
		return NULL;
	}
	timer->live = 0;
	timer->timevalue = xTimerPeriodInTicks;
	timer->data = pvTimerID;
	timer->function = pxCallbackFunction;
	return (_timerHandle) timer;
}

u32 _tizenrt_timerDelete(_timerHandle xTimer, osdepTickType xBlockTime)
{
	struct timer_list_priv *timer = (struct timer_list_priv *)xTimer;
	int ret = work_cancel(LPWORK, timer->work_hdl);
	if (ret != OK) {
		goto cleanup;
	}
	timer->data = NULL;
	timer->timer_hdl = NULL;
	timer->timevalue = 0;
	timer->live = 0;
	kmm_free(timer->work_hdl);
	kmm_free(timer);
	return _SUCCESS;

cleanup:
	if (ret != -2) {
		timer->data = NULL;
		timer->timer_hdl = NULL;
		timer->timevalue = 0;
		timer->live = 0;
		kmm_free(timer->work_hdl);
		kmm_free(timer);
		DBG_ERR("_tizenrt_del_timer failed! ret = %d", ret);
		return _FAIL;
	}
	timer->data = NULL;
	timer->timer_hdl = NULL;
	timer->timevalue = 0;
	timer->live = 0;
	kmm_free(timer->work_hdl);
	kmm_free(timer);

	return _SUCCESS;
}

u32 _tizenrt_timerIsTimerActive(_timerHandle xTimer)
{
	struct timer_list_priv *timer = (struct timer_list_priv *)xTimer;

	return timer->live;
}

u32 _tizenrt_timerStop(_timerHandle xTimer, osdepTickType xBlockTime)
{
	struct timer_list_priv *timer = (struct timer_list_priv *)xTimer;

	int ret = work_cancel(LPWORK, timer->work_hdl);
	if (ret != OK) {
		goto cleanup;
	}
	timer->timevalue = 0;
	timer->live = 0;
	return _SUCCESS;

cleanup:
	if (ret != -2) {
		kmm_free(timer->work_hdl);
		kmm_free(timer);
		DBG_ERR("_tizenrt_stop_timer failed! ret = %d", ret);
		return _FAIL;
	}
	timer->timevalue = 0;
	timer->live = 0;
	DBG_ERR("_tizenrt_stop_timer is Done! timer->work_hdl = %x", timer->work_hdl);
	return _SUCCESS;
}

u32 _tizenrt_timerChangePeriod(_timerHandle xTimer, osdepTickType xNewPeriod, osdepTickType xBlockTime)
{
	int ret;
	struct timer_list_priv *timer = (struct timer_list_priv *)xTimer;
	ret = work_queue(LPWORK, timer->work_hdl, timer->function, (void *)(timer), xNewPeriod);
	if (ret == -EALREADY) {
		if (work_cancel(LPWORK, timer->work_hdl) != OK) {
			goto cleanup;
		}
		if (work_queue(LPWORK, timer->work_hdl, timer->function, (void *)(timer), xNewPeriod)) {
			goto cleanup;
		}
	}
	return _SUCCESS;

cleanup:
	kmm_free(timer->work_hdl);
	timer->timer_hdl = NULL;
	timer->live = 0;
	kmm_free(timer);
	DBG_ERR("_tizenrt_set_timer failed!");
	return _FAIL;
}

void *_tizenrt_timerGetID(_timerHandle xTimer)
{
	struct timer_list_priv *timer = (struct timer_list_priv *)xTimer;
	return timer->data;
}

u32 _tizenrt_timerStart(_timerHandle xTimer, osdepTickType xBlockTime)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

u32 _tizenrt_timerStartFromISR(_timerHandle xTimer, osdepBASE_TYPE *pxHigherPriorityTaskWoken)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

u32 _tizenrt_timerStopFromISR(_timerHandle xTimer, osdepBASE_TYPE *pxHigherPriorityTaskWoken)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

u32 _tizenrt_timerResetFromISR(_timerHandle xTimer, osdepBASE_TYPE *pxHigherPriorityTaskWoken)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

u32 _tizenrt_timerChangePeriodFromISR(_timerHandle xTimer, osdepTickType xNewPeriod, osdepBASE_TYPE *pxHigherPriorityTaskWoken)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

u32 _tizenrt_timerReset(_timerHandle xTimer, osdepTickType xBlockTime)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

void _tizenrt_acquire_wakelock(void)
{
}

void _tizenrt_release_wakelock(void)
{
}

void _tizenrt_wakelock_timeout(uint32_t timeout)
{
}

u8 _tizenrt_get_scheduler_state(void)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

static IRQ_FUN TizenUserIrqFunTable[MAX_PERIPHERAL_IRQ_NUM];
static int wrapper_IrqFun(int irq, FAR void *context, FAR void *arg)
{
	if (irq < AMEBAD_IRQ_FIRST) {
		DiagPrintf("INT %d should not come here\r\n", irq);
		return OK;
	}
	__NVIC_ClearPendingIRQ(irq - AMEBAD_IRQ_FIRST);
	if (TizenUserIrqFunTable[irq - AMEBAD_IRQ_FIRST] != NULL) {
		TizenUserIrqFunTable[irq - AMEBAD_IRQ_FIRST]((VOID *)(arg));
	} else {
		DiagPrintf("INT_Entry Irq %d Fun Not Assign!!!!!", irq - AMEBAD_IRQ_FIRST);
	}
	return OK;
}

BOOL irq_register(IRQ_FUN IrqFun, IRQn_Type IrqNum, u32 Data, u32 Priority)
{
	if (IrqNum < 0) {
		DiagPrintf("INT %d should not come here\r\n", IrqNum);
		return _TRUE;
	}
	Priority = (Priority >> IRQ_PRIORITY_SHIFT);
	if (IrqNum == WL_DMA_IRQ || IrqNum == WL_PROTOCOL_IRQ) {
		Priority = 4;
	}
	TizenUserIrqFunTable[IrqNum] = (IRQ_FUN)((u32) IrqFun | 0x1);
	Priority = (Priority << (8 - __NVIC_PRIO_BITS));
	irq_attach(IrqNum + AMEBAD_IRQ_FIRST, wrapper_IrqFun, (void *)Data);
	up_prioritize_irq(IrqNum + AMEBAD_IRQ_FIRST, Priority);	//Need to fix, because it can't get the same result as __NVIC_SetPriority
	return _TRUE;
}

BOOL irq_unregister(IRQn_Type IrqNum)
{
	if (IrqNum < 0) {
		DiagPrintf("INT %d should not come here\r\n", IrqNum);
		return _TRUE;
	}
	irq_detach(IrqNum);
	TizenUserIrqFunTable[IrqNum] = NULL;
	return _TRUE;
}

void irq_enable(IRQn_Type IrqNum)
{
	if (IrqNum < 0) {
		DiagPrintf("INT %d should not come here\r\n", IrqNum);
		return;
	}
	up_enable_irq(IrqNum + AMEBAD_IRQ_FIRST);
}

void irq_disable(IRQn_Type IrqNum)
{
	if (IrqNum < 0) {
		DiagPrintf("INT %d should not come here\r\n", IrqNum);
		return;
	}
	up_disable_irq(IrqNum + AMEBAD_IRQ_FIRST);
}

int __wrap_printf(const char *format, ...)
{
	int ret = 0;
	va_list args;
	va_start(args, (const char *)format);
	ret = DiagPrintf((const char *)format, args);
	va_end(args);
	return ret;
}

void shell_switch_ipc_int(VOID *Data, u32 IrqStatus, u32 ChanNum)
{
	DiagPrintf("%s %d\r\n", __func__, __LINE__);
}

uint32_t *vTaskStackAddr(void)
{
	struct tcb_s *rtcb = this_task();
	/* Get the limits on the user stack memory */
	return (uint32_t *)rtcb->adj_stack_ptr;
}

uint32_t vTaskStackSize(void)
{
	struct tcb_s *rtcb = this_task();
	return (uint32_t)rtcb->adj_stack_size;
}

char * vTaskName(void)
{
	struct tcb_s *rtcb = this_task();
	return (char *)rtcb->name;
}

void vPortEnterCritical(void)
{
	save_and_cli();
}

void vPortExitCritical(void)
{
	restore_flags();
}

void vTaskDelay(int ms)
{
	_tizenrt_mdelay_os(ms);
}

