yangkunming99/TizenRT/os/board/rtl8721csm/src/component/os/tizenrt/tizenrt_service.c
const struct osdep_service_ops osdep_service = {
	_tizenrt_malloc,			//rtw_vmalloc
	_tizenrt_zmalloc,			//rtw_zvmalloc
	_tizenrt_mfree,				//rtw_vmfree
	_tizenrt_malloc,			//rtw_malloc
	_tizenrt_zmalloc,			//rtw_zmalloc
	_tizenrt_mfree,				//rtw_mfree
	_tizenrt_memcpy,			//rtw_memcpy
	_tizenrt_memcmp,			//rtw_memcmp
	_tizenrt_memset,			//rtw_memset
	_tizenrt_init_sema,			//rtw_init_sema
	_tizenrt_free_sema,			//rtw_free_sema
	_tizenrt_up_sema,			//rtw_up_sema
	_tizenrt_up_sema_from_isr,	//rtw_up_sema_from_isr
	_tizenrt_down_sema,			//rtw_down_sema
	_tizenrt_mutex_init,		//rtw_mutex_init
	_tizenrt_mutex_free,		//rtw_mutex_free
	_tizenrt_mutex_get,			//rtw_mutex_get
	_tizenrt_mutex_get_timeout,	//rtw_mutex_get_timeout
	_tizenrt_mutex_put,			//rtw_mutex_put
	_tizenrt_enter_critical,	//rtw_enter_critical
	_tizenrt_exit_critical,		//rtw_exit_critical
	_tizenrt_enter_critical_from_isr,	//rtw_enter_critical_from_isr
	_tizenrt_exit_critical_from_isr,	//rtw_exit_critical_from_isr
	NULL,						//rtw_enter_critical_bh
	NULL,						//rtw_exit_critical_bh
	_tizenrt_enter_critical_mutex,	//rtw_enter_critical_mutex
	_tizenrt_exit_critical_mutex,	//rtw_exit_critical_mutex
	_tizenrt_cpu_lock,
	_tizenrt_cpu_unlock,
	_tizenrt_spinlock_init,		//rtw_spinlock_init
	_tizenrt_spinlock_free,		//rtw_spinlock_free
	_tizenrt_spinlock,			//rtw_spin_lock
	_tizenrt_spinunlock,		//rtw_spin_unlock
	_tizenrt_spinlock_irqsave,	//rtw_spinlock_irqsave
	_tizenrt_spinunlock_irqsave,	//rtw_spinunlock_irqsave
	_tizenrt_init_xqueue,		//rtw_init_xqueue
	_tizenrt_push_to_xqueue,	//rtw_push_to_xqueue
	_tizenrt_pop_from_xqueue,	//rtw_pop_from_xqueue
	_tizenrt_peek_from_xqueue,		//rtw_peek_from_xqueue
	_tizenrt_deinit_xqueue,		//rtw_deinit_xqueue
	_tizenrt_get_current_time,	//rtw_get_current_time
	_tizenrt_systime_to_ms,		//rtw_systime_to_ms
	_tizenrt_systime_to_sec,	//rtw_systime_to_sec
	_tizenrt_ms_to_systime,		//rtw_ms_to_systime
	_tizenrt_sec_to_systime,	//rtw_sec_to_systime
	_tizenrt_msleep_os,			//rtw_msleep_os
	_tizenrt_usleep_os,			//rtw_usleep_os
	_tizenrt_mdelay_os,			//rtw_mdelay_os
	_tizenrt_udelay_os,			//rtw_udelay_os
	_tizenrt_yield_os,			//rtw_yield_os

	_tizenrt_ATOMIC_SET,		//ATOMIC_SET
	_tizenrt_ATOMIC_READ,		//ATOMIC_READ
	_tizenrt_ATOMIC_ADD,		//ATOMIC_ADD
	_tizenrt_ATOMIC_SUB,		//ATOMIC_SUB
	_tizenrt_ATOMIC_INC,		//ATOMIC_INC
	_tizenrt_ATOMIC_DEC,		//ATOMIC_DEC
	_tizenrt_ATOMIC_ADD_RETURN,	//ATOMIC_ADD_RETURN
	_tizenrt_ATOMIC_SUB_RETURN,	//ATOMIC_SUB_RETURN
	_tizenrt_ATOMIC_INC_RETURN,	//ATOMIC_INC_RETURN
	_tizenrt_ATOMIC_DEC_RETURN,	//ATOMIC_DEC_RETURN

	_tizenrt_modular64,			//rtw_modular64
	_tizenrt_get_random_bytes,	//rtw_get_random_bytes
	_tizenrt_GetFreeHeapSize,	//rtw_getFreeHeapSize

	_tizenrt_create_task,		//rtw_create_task
	_tizenrt_delete_task,		//rtw_delete_task
	NULL,			//rtw_wakeup_task
	_tizenrt_set_priority_task,	//rtw_set_priority_task
	_tizenrt_get_priority_task,	//rtw_get_priority_task
	_tizenrt_suspend_task,			//rtw_suspend_task
	_tizenrt_resume_task,			//rtw_resume_task

	_tizenrt_thread_enter,		//rtw_thread_enter
	_tizenrt_thread_exit,		//rtw_thread_exit

	_tizenrt_timerCreate,		//rtw_timerCreate,
	_tizenrt_timerDelete,		//rtw_timerDelete,
	_tizenrt_timerIsTimerActive,	//rtw_timerIsTimerActive,
	_tizenrt_timerStop,			//rtw_timerStop,
	_tizenrt_timerChangePeriod,	//rtw_timerChangePeriod
	_tizenrt_timerGetID,		//rtw_timerGetID
	_tizenrt_timerStart,		//rtw_timerStart
	_tizenrt_timerStartFromISR,	//rtw_timerStartFromISR
	_tizenrt_timerStopFromISR,	//rtw_timerStopFromISR
	_tizenrt_timerResetFromISR,	//rtw_timerResetFromISR
	_tizenrt_timerChangePeriodFromISR,	//rtw_timerChangePeriodFromISR
	_tizenrt_timerReset,		//rtw_timerReset

	_tizenrt_acquire_wakelock,	//rtw_acquire_wakelock
	_tizenrt_release_wakelock,	//rtw_release_wakelock
	_tizenrt_wakelock_timeout,	//rtw_wakelock_timeout
	_tizenrt_get_scheduler_state,	//rtw_get_scheduler_state
	NULL,						// rtw_create_secure_context
	NULL,						//rtw_get_current_TaskHandle
};
